<?php

namespace Database\Seeders;

use App\Models\Country;
use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CairoSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $cairo = Country::where('english_name', 'Cairo')->first();
        if (!$cairo) {
            $cairo = Country::create(['english_name' => 'Cairo']);
        }

        // Insert regions for Egypt
        $arabic_region = [
            'وسط البلد',
            'الزمالك',
            'العباسية',
            'النزهة',
            'مدينة نصر',
            'القاهرة الجديدة',
            'هليوبوليس الجديدة',
            'بدر',
            'العبور',
            'الشروق',
            'مدينتى',
            'العاشر من رمضان',
            'مدينة بنها',
            'العاصمة الإدارية الجديدة',
            'التجمع الأول',
            'التجمع الثالث',
            'التجمع الخامس',
            'البساتين',
            'التبين',
            'التونسى (القاهرة)',
            'الجزيرة (القاهرة)',
            'الجمالية',
            'الحسين',
            'الحلمية',
            'الحلمية الجديدة',
            'الخليفة',
            'الدرب الأحمر',
            'الدويقة',
            'الزاوية الحمراء',
            'الزيتون',
            'الساحل',
            'شبرا',
            'الشرابية',
            'روض الفرج',
            'السلام',
            'السيدة زينب',
            'الصاغة',
            'الفجالة',
            'القاهرة القبطية',
            'القطامية',
            'اللوتس',
            'المرج',
            'المستثمرين الجنوبية',
            'المستثمرين الشمالية',
            'المطرية',
            'المقطم',
            'المنيرة',
            'المنيرة الجديدة',
            'الموسكى',
            'الوايلي',
            'باب الشعرية',
            'باب اللوق',
            'بولاق أبو العلا',
            'ثكنات المعادى',
            'المعادى',
            'جاردن سيتى',
            'جزيرة الروضة',
            'جسر السويس',
            'حارة اليهود',
            'حدائق القبة',
            'حدائق المعادى',
            'حى الخليفة',
            'حى السفارات',
            'دار السلام',
            'سراى القبة',
            'شارع الأزهر',
            'شارع الجمهورية',
            'شارع القصر العينى',
            'شارع أمين سامى باشا',
            'شارع بورسعيد',
            'شارع صلاح سالم',
            'شارع عباس العقاد',
            'شارع عماد الدين',
            'شارع محمد على',
            'شارع محمد محمود',
            'شارع مكرم عبيد',
            'عابدين',
            'عبود',
            'قصر النيل',
            'كوتسيكا',
            'مدينة البنفسج',
            'مدينة الرحاب',
            'مدينة النرجس',
            'مدينة الياسمين',
            'مدينة نصر',
            'مدينة السلام',
            'مساكن شيراتون المطار',
            'مصر الجديدة',
            'مصر القديمة',
            'منشية ناصر',
            'ميدان أحمد حلمى',
            'ميدان الأوبرا',
            'ميدان التوفيقية',
            'ميدان الجيزة',
            'ميدان الرماية',
            'ميدان السيدة زينب',
            'ميدان الشهيد هشام بركات',
            'ميدان العباسية',
            'ميدان العتبة الخضراء',
            'ميدان الفلكى',
            'ميدان القلعة',
            'ميدان باب الخلق',
            'ميدان باب اللوق',
            'ميدان جامعة القاهرة',
            'ميدان حدائق القبة',
            'ميدان رمسيس',
            'ميدان روكسى',
            'ميدان سفنكس',
            'ميدان طلعت حرب',
            'ميدان عابدين',
            'ميدان عبد المنعم رياض',
            'ميدان لاظوغلى',
            'ميدان لبنان',
            'ميدان محمد فريد',
            'ميدان مصطفى كامل',
            'ميدان مصطفى محمود',
           
        ];
    

        foreach ($arabic_region as $index => $arabic_region) {
            $english_region = $english_region[$index] ?? ''; 
            Region::create([
                'arabic_name' => $arabic_region,
                'english_name' => $english_region,
                'country_id' => $cairo->id
            ]);
        }
    }
}
